Revit 2024 API
StructuralSettings.ShowBraceAbove Property
 Whether to show brace symbols above beams in plan views.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool ShowBraceAbove { get; set; }
Visual Basic
Public Property ShowBraceAbove As Boolean
	Get
	Set
Visual C++
public:
property bool ShowBraceAbove {
	bool get ();
	void set (bool value);
}
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace